# SetExternalItems Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TransferringProjectStandardsEventArgs..::..SetExternalItems Method
TransferringProjectStandardsEventArgs Class See Also
---
Sets the collection of externally added items which should be shown in the Transfer Project Standards dialog as options.
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017.2
# Syntax
C#
---
```text
public void SetExternalItems(
	IDictionary<Guid, string> externalItems
)
```

Visual Basic
---
```text
Public Sub SetExternalItems ( _
	externalItems As IDictionary(Of Guid, String) _
)
```

Visual C++
---
```text
public:
void SetExternalItems(
	IDictionary<Guid, String^>^ externalItems
)
```

# ### Parameters
externalItems
    Type: System.Collections.Generic..::..IDictionary<(Of <(<'Guid, String>)>)> The external items which are displayed in the Transfer Project Standards UI. GUIDvalue is used to identify the external item string.
# Remarks
The externally added items that the user opted to transfer will be reported in the args to the TransferredProjectStandards event.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
TransferringProjectStandardsEventArgs Class
Autodesk.Revit.UI.Events Namespace